## Pandas

In [1]:
import pandas as pd

In [56]:
df = pd.read_csv('dataset1.csv')

In [57]:
df

    club last_name first_name position  base_salary  guaranteed_compensation
0    ATL   Almiron     Miguel        M    1912500.0               2297000.00
1    ATL   Ambrose      Mikey        D      65625.0                 65625.00
2    ATL      Asad      Yamil        M     150000.0                150000.00
3    ATL     Bloom       Mark        D      99225.0                106573.89
4    ATL  Carleton     Andrew        F      65000.0                 77400.00
..   ...       ...        ...      ...          ...                      ...
610  VAN   Teibert    Russell        M     126500.0                194000.00
611  VAN  Tornaghi      Paolo       GK      80000.0                 80000.00
612  VAN    Waston    Kendall        D     350000.0                368125.00
613  NaN       NaN        NaN      NaN          NaN                      NaN
614  VAN  Williams    Sheanon        D     175000.0                184000.00

[615 rows x 6 columns]

In [58]:
df.size

3690

In [59]:
df.shape

(615, 6)

In [60]:
df.head()

  club last_name first_name position  base_salary  guaranteed_compensation
0  ATL   Almiron     Miguel        M    1912500.0               2297000.00
1  ATL   Ambrose      Mikey        D      65625.0                 65625.00
2  ATL      Asad      Yamil        M     150000.0                150000.00
3  ATL     Bloom       Mark        D      99225.0                106573.89
4  ATL  Carleton     Andrew        F      65000.0                 77400.00

In [61]:
df.tail()

    club last_name first_name position  base_salary  guaranteed_compensation
610  VAN   Teibert    Russell        M     126500.0                 194000.0
611  VAN  Tornaghi      Paolo       GK      80000.0                  80000.0
612  VAN    Waston    Kendall        D     350000.0                 368125.0
613  NaN       NaN        NaN      NaN          NaN                      NaN
614  VAN  Williams    Sheanon        D     175000.0                 184000.0

In [62]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 615 entries, 0 to 614
Data columns (total 6 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   club                     614 non-null    object
 1   last_name                614 non-null    object
 2   first_name               610 non-null    object
 3   position                 604 non-null    object
 4   base_salary              614 non-null    float64
 5   guaranteed_compensation  614 non-null    float64
dtypes: float64(2), object(4)
memory usage: 29.0+ KB

In [63]:
df.describe()

        base_salary  guaranteed_compensation
count  6.140000e+02             6.140000e+02
mean   2.971730e+05             3.263752e+05
std    6.725839e+05             7.491217e+05
min    5.299992e+04             5.299992e+04
25%    6.563340e+04             7.003035e+04
50%    1.250000e+05             1.350020e+05
75%    2.550000e+05             2.798750e+05
max    6.660000e+06             7.167500e+06

In [64]:
df.club.describe()

count     614
unique     23
top       VAN
freq       32
Name: club, dtype: object

In [65]:
df.value_counts()

club  last_name  first_name  position  base_salary  guaranteed_compensation
ATL   Almiron    Miguel      M         1912500.0    2297000.0                  1
ORL   Perez      Matias      F         260004.0     260004.0                   1
      Redding    Tommy       D         110000.0     117500.0                   1
      Rivas      Carlos      M         375000.0     375000.0                   1
      Rocha      Tony        M         65620.8      65620.8                    1
                                                                              ..
KC    Iwasa      Cameron     F         53004.0      53004.0                    1
      Juliao     Igor        D         100008.0     115008.0                   1
      Medranda   Jimmy       D         130008.0     130008.0                   1
      Melia      Tim         GK        165000.0     167500.0                   1
VAN   de Jong    Marcel      D-M       140000.0     140000.0                   1
Length: 600, dtype: int64

In [66]:
df.dtypes.value_counts()

object     4
float64    2
dtype: int64

In [67]:
df.dtypes

club                        object
last_name                   object
first_name                  object
position                    object
base_salary                float64
guaranteed_compensation    float64
dtype: object

In [68]:
df.club.value_counts()

VAN      32
PHI      31
ATL      31
CLB      30
ORL      30
DAL      29
SJ       29
NYCFC    28
HOU      28
NYRB     28
TOR      27
RSL      27
POR      27
MTL      27
CHI      27
MNUFC    27
LA       27
DC       27
KC       26
COL      26
SEA      25
NE       23
LAFC      2
Name: club, dtype: int64

In [69]:
df['club']

0      ATL
1      ATL
2      ATL
3      ATL
4      ATL
      ...
610    VAN
611    VAN
612    VAN
613    NaN
614    VAN
Name: club, Length: 615, dtype: object

In [70]:
df.club

0      ATL
1      ATL
2      ATL
3      ATL
4      ATL
      ...
610    VAN
611    VAN
612    VAN
613    NaN
614    VAN
Name: club, Length: 615, dtype: object

In [71]:
type(df['club'])

pandas.core.series.Series

In [72]:
dados = [['a', 1, 1.1], ['b', 2, 2.2], ['c', 3, 3.3]]

df_teste = pd.DataFrame(dados)

In [73]:
df_teste

   0  1    2
0  a  1  1.1
1  b  2  2.2
2  c  3  3.3

In [74]:
df['first_name']

0       Miguel
1        Mikey
2        Yamil
3         Mark
4       Andrew
        ...
610    Russell
611      Paolo
612    Kendall
613        NaN
614    Sheanon
Name: first_name, Length: 615, dtype: object

In [75]:
df[['first_name', 'base_salary']]

    first_name  base_salary
0       Miguel    1912500.0
1        Mikey      65625.0
2        Yamil     150000.0
3         Mark      99225.0
4       Andrew      65000.0
..         ...          ...
610    Russell     126500.0
611      Paolo      80000.0
612    Kendall     350000.0
613        NaN          NaN
614    Sheanon     175000.0

[615 rows x 2 columns]

In [76]:
df[['first_name', 'base_salary']].head()

  first_name  base_salary
0     Miguel    1912500.0
1      Mikey      65625.0
2      Yamil     150000.0
3       Mark      99225.0
4     Andrew      65000.0

In [77]:
df[['first_name', 'base_salary']].describe()

        base_salary
count  6.140000e+02
mean   2.971730e+05
std    6.725839e+05
min    5.299992e+04
25%    6.563340e+04
50%    1.250000e+05
75%    2.550000e+05
max    6.660000e+06

In [78]:
df[['first_name', 'base_salary']].info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 615 entries, 0 to 614
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   first_name   610 non-null    object
 1   base_salary  614 non-null    float64
dtypes: float64(1), object(1)
memory usage: 9.7+ KB

In [79]:
df[['first_name', 'base_salary']].dtypes

first_name      object
base_salary    float64
dtype: object

In [80]:
type(df[['first_name', 'base_salary']])

pandas.core.frame.DataFrame

In [81]:
df[['first_name', 'base_salary', 'club']]

    first_name  base_salary club
0       Miguel    1912500.0  ATL
1        Mikey      65625.0  ATL
2        Yamil     150000.0  ATL
3         Mark      99225.0  ATL
4       Andrew      65000.0  ATL
..         ...          ...  ...
610    Russell     126500.0  VAN
611      Paolo      80000.0  VAN
612    Kendall     350000.0  VAN
613        NaN          NaN  NaN
614    Sheanon     175000.0  VAN

[615 rows x 3 columns]

In [82]:
salarios_atletas = ['first_name', 'base_salary', 'club']

In [83]:
type(salarios_atletas)

list

In [84]:
df[salarios_atletas]

    first_name  base_salary club
0       Miguel    1912500.0  ATL
1        Mikey      65625.0  ATL
2        Yamil     150000.0  ATL
3         Mark      99225.0  ATL
4       Andrew      65000.0  ATL
..         ...          ...  ...
610    Russell     126500.0  VAN
611      Paolo      80000.0  VAN
612    Kendall     350000.0  VAN
613        NaN          NaN  NaN
614    Sheanon     175000.0  VAN

[615 rows x 3 columns]

In [85]:
df[salarios_atletas].shape

(615, 3)

In [86]:
df[salarios_atletas].tail()

    first_name  base_salary club
610    Russell     126500.0  VAN
611      Paolo      80000.0  VAN
612    Kendall     350000.0  VAN
613        NaN          NaN  NaN
614    Sheanon     175000.0  VAN

In [87]:
df['salario_final'] = 0

In [88]:
df

,club,last_name,first_name,position,base_salary,guaranteed_compensation,salario_final
0,ATL,Almiron,Miguel,M,1912500.0,2297000.00,0
1,ATL,Ambrose,Mikey,D,65625.0,65625.00,0
2,ATL,Asad,Yamil,M,150000.0,150000.00,0
3,ATL,Bloom,Mark,D,99225.0,106573.89,0
4,ATL,Carleton,Andrew,F,65000.0,77400.00,0
...,...,...,...,...,...,...,...
610,VAN,Teibert,Russell,M,126500.0,194000.00,0
611,VAN,Tornaghi,Paolo,GK,80000.0,80000.00,0
612,VAN,Waston,Kendall,D,350000.0,368125.00,0
613,NaN,NaN,NaN,NaN,NaN,NaN,0
614,VAN,Williams,Sheanon,D,175000.0,184000.00,0

In [89]:
df['salario_final'] = df['base_salary'] + df['guaranteed_compensation']

In [90]:
df

,club,last_name,first_name,position,base_salary,guaranteed_compensation,salario_final
0,ATL,Almiron,Miguel,M,1912500.0,2297000.00,4209500.00
1,ATL,Ambrose,Mikey,D,65625.0,65625.00,131250.00
2,ATL,Asad,Yamil,M,150000.0,150000.00,300000.00
3,ATL,Bloom,Mark,D,99225.0,106573.89,205798.89
4,ATL,Carleton,Andrew,F,65000.0,77400.00,142400.00
...,...,...,...,...,...,...,...
610,VAN,Teibert,Russell,M,126500.0,194000.00,320500.00
611,VAN,Tornaghi,Paolo,GK,80000.0,80000.00,160000.00
612,VAN,Waston,Kendall,D,350000.0,368125.00,718125.00
613,NaN,NaN,NaN,NaN,NaN,NaN,NaN
614,VAN,Williams,Sheanon,D,175000.0,184000.00,359000.00

In [91]:
df.insert(0, column = 'ID', value = range(1, 1 + len(df)))

In [92]:
df.head()

,ID,club,last_name,first_name,position,base_salary,guaranteed_compensation,salario_final
0,1,ATL,Almiron,Miguel,M,1912500.0,2297000.00,4209500.00
1,2,ATL,Ambrose,Mikey,D,65625.0,65625.00,131250.00
2,3,ATL,Asad,Yamil,M,150000.0,150000.00,300000.00
3,4,ATL,Bloom,Mark,D,99225.0,106573.89,205798.89
4,5,ATL,Carleton,Andrew,F,65000.0,77400.00,142400.00

In [93]:
df.tail()

,ID,club,last_name,first_name,position,base_salary,guaranteed_compensation,salario_final
610,611,VAN,Teibert,Russell,M,126500.0,194000.0,320500.0
611,612,VAN,Tornaghi,Paolo,GK,80000.0,80000.0,160000.0
612,613,VAN,Waston,Kendall,D,350000.0,368125.0,718125.0
613,614,NaN,NaN,NaN,NaN,NaN,NaN,NaN
614,615,VAN,Williams,Sheanon,D,175000.0,184000.0,359000.0

In [94]:
df['base_salary'].add(5)

0      1912505.0
1        65630.0
2       150005.0
3        99230.0
4        65005.0
         ...
610     126505.0
611      80005.0
612     350005.0
613          NaN
614     175005.0
Name: base_salary, Length: 615, dtype: float64

In [95]:
df['base_salary'] = df['base_salary'].add(5)

In [96]:
df['base_salary_eur'] = df['base_salary'].mul(0.92)

In [97]:
df

,ID,club,last_name,first_name,position,base_salary,guaranteed_compensation,salario_final,base_salary_eur
0,1,ATL,Almiron,Miguel,M,1912505.0,2297000.00,4209500.00,1759504.6
1,2,ATL,Ambrose,Mikey,D,65630.0,65625.00,131250.00,60379.6
2,3,ATL,Asad,Yamil,M,150005.0,150000.00,300000.00,138004.6
3,4,ATL,Bloom,Mark,D,99230.0,106573.89,205798.89,91291.6
4,5,ATL,Carleton,Andrew,F,65005.0,77400.00,142400.00,59804.6
...,...,...,...,...,...,...,...,...,...
610,611,VAN,Teibert,Russell,M,126505.0,194000.00,320500.00,116384.6
611,612,VAN,Tornaghi,Paolo,GK,80005.0,80000.00,160000.00,73604.6
612,613,VAN,Waston,Kendall,D,350005.0,368125.00,718125.00,322004.6
613,614,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
614,615,VAN,Williams,Sheanon,D,175005.0,184000.00,359000.00,161004.6

In [98]:
df.drop(columns = ['base_salary_eur'], inplace = True)

In [99]:
df

,ID,club,last_name,first_name,position,base_salary,guaranteed_compensation,salario_final
0,1,ATL,Almiron,Miguel,M,1912505.0,2297000.00,4209500.00
1,2,ATL,Ambrose,Mikey,D,65630.0,65625.00,131250.00
2,3,ATL,Asad,Yamil,M,150005.0,150000.00,300000.00
3,4,ATL,Bloom,Mark,D,99230.0,106573.89,205798.89
4,5,ATL,Carleton,Andrew,F,65005.0,77400.00,142400.00
...,...,...,...,...,...,...,...,...
610,611,VAN,Teibert,Russell,M,126505.0,194000.00,320500.00
611,612,VAN,Tornaghi,Paolo,GK,80005.0,80000.00,160000.00
612,613,VAN,Waston,Kendall,D,350005.0,368125.00,718125.00
613,614,NaN,NaN,NaN,NaN,NaN,NaN,NaN
614,615,VAN,Williams,Sheanon,D,175005.0,184000.00,359000.00

In [101]:
df.insert(6, column = 'base_salary_eur', value = df['base_salary'].mul(0.92))

In [102]:
df

,ID,club,last_name,first_name,position,base_salary,base_salary_eur,guaranteed_compensation,salario_final
0,1,ATL,Almiron,Miguel,M,1912505.0,1759504.6,2297000.00,4209500.00
1,2,ATL,Ambrose,Mikey,D,65630.0,60379.6,65625.00,131250.00
2,3,ATL,Asad,Yamil,M,150005.0,138004.6,150000.00,300000.00
3,4,ATL,Bloom,Mark,D,99230.0,91291.6,106573.89,205798.89
4,5,ATL,Carleton,Andrew,F,65005.0,59804.6,77400.00,142400.00
...,...,...,...,...,...,...,...,...,...
610,611,VAN,Teibert,Russell,M,126505.0,116384.6,194000.00,320500.00
611,612,VAN,Tornaghi,Paolo,GK,80005.0,73604.6,80000.00,160000.00
612,613,VAN,Waston,Kendall,D,350005.0,322004.6,368125.00,718125.00
613,614,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
614,615,VAN,Williams,Sheanon,D,175005.0,161004.6,184000.00,359000.00

In [103]:
df.rename(
    columns = {
        'base_salary': 'base_salary_usd', 
        'guaranteed_compensation': 'guaranteed_compensation_usd', 
        'salary_final': 'salary_final_usd'
    },
    inplace = True
)

In [104]:
df

,ID,club,last_name,first_name,position,base_salary_usd,base_salary_eur,guaranteed_compensation_usd,salario_final
0,1,ATL,Almiron,Miguel,M,1912505.0,1759504.6,2297000.00,4209500.00
1,2,ATL,Ambrose,Mikey,D,65630.0,60379.6,65625.00,131250.00
2,3,ATL,Asad,Yamil,M,150005.0,138004.6,150000.00,300000.00
3,4,ATL,Bloom,Mark,D,99230.0,91291.6,106573.89,205798.89
4,5,ATL,Carleton,Andrew,F,65005.0,59804.6,77400.00,142400.00
...,...,...,...,...,...,...,...,...,...
610,611,VAN,Teibert,Russell,M,126505.0,116384.6,194000.00,320500.00
611,612,VAN,Tornaghi,Paolo,GK,80005.0,73604.6,80000.00,160000.00
612,613,VAN,Waston,Kendall,D,350005.0,322004.6,368125.00,718125.00
613,614,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
614,615,VAN,Williams,Sheanon,D,175005.0,161004.6,184000.00,359000.00

In [113]:
stock = {
    'AMZN': pd.Series([346.15, 0.59, 459, 0.52, 589.8, 158.88],
                     index = ['Closing price', 'EPS', 'Shares Outstanding(M)', 'Beta', 'P/E', 'Market Cap(B)']),
    'GOOG': pd.Series([1133.43, 36.05, 335.83, 0.87, 31.44, 380.64],
                     index = ['Closing price', 'EPS', 'Shares Outstanding(M)', 'Beta', 'P/E', 'Market Cap(B)']),
    'FB': pd.Series([61.48, 0.59, 2450, 104.93, 150.92],
                     index = ['Closing price', 'EPS', 'Shares Outstanding(M)', 'P/E', 'Market Cap(B)']),
    'YHOO': pd.Series([34.90, 1.27, 1010, 27.48, 0.66, 35.36],
                     index = ['Closing price', 'EPS', 'Shares Outstanding(M)', 'P/E', 'Beta', 'Market Cap(B)']),
    'TWTR': pd.Series([65.25, -0.3, 555.2, 36.23],
                     index = ['Closing price', 'EPS', 'Shares Outstanding(M)', 'Market Cap(B)']),
    'AAPL': pd.Series([501.53, 40.32, 892.45, 12.44, 447.59, 0.84],
                     index = ['Closing price', 'EPS', 'Shares Outstanding(M)', 'P/E', 'market Cap(B)', 'Beta'])
    
}

In [114]:
stock

{'AMZN': Closing price            346.15
 EPS                        0.59
 Shares Outstanding(M)    459.00
 Beta                       0.52
 P/E                      589.80
 Market Cap(B)            158.88
 dtype: float64,
 'GOOG': Closing price            1133.43
 EPS                        36.05
 Shares Outstanding(M)     335.83
 Beta                        0.87
 P/E                        31.44
 Market Cap(B)             380.64
 dtype: float64,
 'FB': Closing price              61.48
 EPS                         0.59
 Shares Outstanding(M)    2450.00
 P/E                       104.93
 Market Cap(B)             150.92
 dtype: float64,
 'YHOO': Closing price              34.90
 EPS                         1.27
 Shares Outstanding(M)    1010.00
 P/E                        27.48
 Beta                        0.66
 Market Cap(B)              35.36
 dtype: float64,
 'TWTR': Closing price             65.25
 EPS                       -0.30
 Shares Outstanding(M)    555.20
 Market Cap(B)             36.23
 dtype: float64,
 'AAPL': Closing price            501.53
 EPS                       40.32
 Shares Outstanding(M)    892.45
 P/E                       12.44
 market Cap(B)            447.59
 Beta                       0.84
 dtype: float64}

In [115]:
type(stock)

dict

In [117]:
stock_df = pd.DataFrame(stock)

In [118]:
stock_df.head()

                 AMZN     GOOG      FB   YHOO   TWTR    AAPL
Beta             0.52     0.87     NaN   0.66    NaN    0.84
Closing price  346.15  1133.43   61.48  34.90  65.25  501.53
EPS              0.59    36.05    0.59   1.27  -0.30   40.32
Market Cap(B)  158.88   380.64  150.92  35.36  36.23     NaN
P/E            589.80    31.44  104.93  27.48    NaN   12.44

In [119]:
stock_df = pd.DataFrame(stock, index = ['Closing price', 'EPS', 'Shares Outstanding(M)', 'P/E', 'Market Cap(B)', 'Beta'])

In [120]:
stock_df

                         AMZN     GOOG       FB     YHOO    TWTR    AAPL
Closing price          346.15  1133.43    61.48    34.90   65.25  501.53
EPS                      0.59    36.05     0.59     1.27   -0.30   40.32
Shares Outstanding(M)  459.00   335.83  2450.00  1010.00  555.20  892.45
P/E                    589.80    31.44   104.93    27.48     NaN   12.44
Market Cap(B)          158.88   380.64   150.92    35.36   36.23     NaN
Beta                     0.52     0.87      NaN     0.66     NaN    0.84

In [121]:
stock_df = pd.DataFrame(stock, index = ['Closing price', 'EPS', 'Shares Outstanding(M)', 'P/E', 'Market Cap(B)', 'Beta'], columns = ['AMZN', 'GOOG', 'FB'])

In [122]:
stock_df

                         AMZN     GOOG       FB
Closing price          346.15  1133.43    61.48
EPS                      0.59    36.05     0.59
Shares Outstanding(M)  459.00   335.83  2450.00
P/E                    589.80    31.44   104.93
Market Cap(B)          158.88   380.64   150.92
Beta                     0.52     0.87      NaN

In [123]:
stock_df.index

Index(['Closing price', 'EPS', 'Shares Outstanding(M)', 'P/E', 'Market Cap(B)',
       'Beta'],
      dtype='object')

In [124]:
stock_df.columns

Index(['AMZN', 'GOOG', 'FB'], dtype='object')

In [111]:
df.set_index('ID', inplace = True)

In [108]:
help(df.set_index)

Help on method set_index in module pandas.core.frame:

set_index(keys, *, drop: 'bool' = True, append: 'bool' = False, inplace: 'bool' = False, verify_integrity: 'bool' = False) -> 'DataFrame | None' method of pandas.core.frame.DataFrame instance
    Set the DataFrame index using existing columns.

    Set the DataFrame index (row labels) using one or more existing
    columns or arrays (of the correct length). The index can replace the
    existing index or expand on it.

    Parameters
    ----------
    keys : label or array-like or list of labels/arrays
        This parameter can be either a single column key, a single array of
        the same length as the calling DataFrame, or a list containing an
        arbitrary combination of column keys and arrays. Here, "array"
        encompasses :class:`Series`, :class:`Index`, ``np.ndarray``, and
        instances of :class:`~collections.abc.Iterator`.
    drop : bool, default True
        Delete columns to be used as the new index.
    append : bool, default False
        Whether to append columns to existing index.
    inplace : bool, default False
        Whether to modify the DataFrame rather than creating a new one.
    verify_integrity : bool, default False
        Check the new index for duplicates. Otherwise defer the check until
        necessary. Setting to False will improve the performance of this
        method.

    Returns
    -------
    DataFrame or None
        Changed row labels or None if ``inplace=True``.

    See Also
    --------
    DataFrame.reset_index : Opposite of set_index.
    DataFrame.reindex : Change to new indices or expand indices.
    DataFrame.reindex_like : Change to same indices as other DataFrame.

    Examples
    --------
    >>> df = pd.DataFrame({'month': [1, 4, 7, 10],
    ...                    'year': [2012, 2014, 2013, 2014],
    ...                    'sale': [55, 40, 84, 31]})
    >>> df
       month  year  sale
    0      1  2012    55
    1      4  2014    40
    2      7  2013    84
    3     10  2014    31

    Set the index to become the 'month' column:

    >>> df.set_index('month')
           year  sale
    month
    1      2012    55
    4      2014    40
    7      2013    84
    10     2014    31

    Create a MultiIndex using columns 'year' and 'month':

    >>> df.set_index(['year', 'month'])
                sale
    year  month
    2012  1     55
    2014  4     40
    2013  7     84
    2014  10    31

    Create a MultiIndex using an Index and a column:

    >>> df.set_index([pd.Index([1, 2, 3, 4]), 'year'])
             month  sale
       year
    1  2012  1      55
    2  2014  4      40
    3  2013  7      84
    4  2014  10     31

    Create a MultiIndex using two Series:

    >>> s = pd.Series([1, 2, 3, 4])
    >>> df.set_index([s, s**2])
          month  year  sale
    1 1       1  2012    55
    2 4       4  2014    40
    3 9       7  2013    84
    4 16     10  2014    31

In [112]:
df

,club,last_name,first_name,position,base_salary_usd,base_salary_eur,guaranteed_compensation_usd,salario_final
ID,,,,,,,,
1,ATL,Almiron,Miguel,M,1912505.0,1759504.6,2297000.00,4209500.00
2,ATL,Ambrose,Mikey,D,65630.0,60379.6,65625.00,131250.00
3,ATL,Asad,Yamil,M,150005.0,138004.6,150000.00,300000.00
4,ATL,Bloom,Mark,D,99230.0,91291.6,106573.89,205798.89
5,ATL,Carleton,Andrew,F,65005.0,59804.6,77400.00,142400.00
...,...,...,...,...,...,...,...,...
611,VAN,Teibert,Russell,M,126505.0,116384.6,194000.00,320500.00
612,VAN,Tornaghi,Paolo,GK,80005.0,73604.6,80000.00,160000.00
613,VAN,Waston,Kendall,D,350005.0,322004.6,368125.00,718125.00
614,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
615,VAN,Williams,Sheanon,D,175005.0,161004.6,184000.00,359000.00

In [5]:
serie_pandas =  pd.Series(['a', 'b', 'c', 10, True], index = [10, 20, 30, 40, 50])

In [6]:
serie_pandas

10       a
20       b
30       c
40      10
50    True
dtype: object

In [7]:
serie_pandas.value_counts()

a       1
b       1
c       1
10      1
True    1
dtype: int64

In [8]:
serie_pandas.values

array(['a', 'b', 'c', 10, True], dtype=object)

In [9]:
serie_pandas.dtypes

dtype('O')

In [10]:
lista = ['data', 'science', 'academy']

In [11]:
series_pandas = pd.Series(lista)

In [12]:
series_pandas

0       data
1    science
2    academy
dtype: object

In [13]:
dicionario  = {'a': 'data', 'b': 'science', 'c': 'academy'}

In [14]:
serie_pandas = pd.Series(dicionario)

In [15]:
serie_pandas

a       data
b    science
c    academy
dtype: object

In [16]:
import numpy as np

In [17]:
arr = np.random.randint(0, 10, size = 5)

In [18]:
arr

array([3, 2, 2, 3, 7])

In [19]:
serie_pandas = pd.Series(arr)

In [20]:
serie_pandas

0    3
1    2
2    2
3    3
4    7
dtype: int64

In [21]:
serie_pandas = pd.Series([201, 307, 500, 10, 85, 15])

In [22]:
serie_pandas.nlargest(n = 3)

2    500
1    307
0    201
dtype: int64

In [23]:
serie_pandas.nsmallest(n = 3)

3    10
5    15
4    85
dtype: int64

In [24]:
serie_pandas = pd.Series(['amarelo', 'azul', 'branco', 'azul', 'verde', 'amarelo', 'azul'])

In [25]:
serie_pandas.values

array(['amarelo', 'azul', 'branco', 'azul', 'verde', 'amarelo', 'azul'],
      dtype=object)

In [26]:
serie_pandas.value_counts()

azul       3
amarelo    2
branco     1
verde      1
dtype: int64

In [27]:
serie_pandas = pd.Series([1, 2, 3, np.nan, np.nan])

In [28]:
serie_pandas

0    1.0
1    2.0
2    3.0
3    NaN
4    NaN
dtype: float64

In [29]:
serie_pandas.isna()

0    False
1    False
2    False
3     True
4     True
dtype: bool

In [30]:
serie_pandas.isna().sum()

2

In [31]:
serie_pandas.count()

3

In [32]:
serie_pandas = pd.Series([1, 2, 3, 4])

In [33]:
serie_pandas.eq(3)

0    False
1    False
2     True
3    False
dtype: bool

In [34]:
serie_pandas.gt(3)

0    False
1    False
2    False
3     True
dtype: bool

In [37]:
serie_pandas = pd.Series([56, 34, 68, 21, 49])

In [38]:
serie_pandas.mean()

45.6

In [40]:
serie_pandas.agg(['mean', 'median', 'sum', 'count'])

mean       45.6
median     49.0
sum       228.0
count       5.0
dtype: float64